# Завдання 1
# Напишіть програму, яка дозволяє користувачеві обчислити частку (ділення одного числа на інше) двох чисел.
# Програма приймає два значення з клавіатури і повертає результат операції на екран. Обробіть виняток, що виникає
# під час ділення на нуль, і виведіть повідомлення про помилку.

print("\n Task 1")

# Завдання 2
# Реалізуйте перше завдання через функцію. Функція повинна приймати два параметри і відображати результат
# ділення на екран. Створіть дві версії реалізації функції:
# Перша версія не обробляє виняток усередині функції. Уся обробка знаходиться зовні;
# Друга версія обробляє виняток усередині функції.

print("\n Task 2")

# Завдання 3
# Напишіть програму, яка приймає рядок і намагається перетворити його на число.
# Обробіть виняток, що виникає при неможливості перетворення, і виведіть повідомлення про помилку.

print("\n Task 3")

# Завдання 4
# Реалізуйте третє завдання через функцію. Функція повинна приймати рядок і відображати результат перетворення на
# екран. Створіть дві версії реалізації функції:
# Перша версія не обробляє виняток усередині функції. Уся обробка знаходиться зовні;
# Друга версія обробляє виняток усередині функції.

print("\n Task 4")