# Завдання 2.
#Користувач вводить з клавіатури три числа. Залежно від
#вибору користувача, програма виводить на екран максимум із
#трьох, мінімум із трьох або середньоарифметичне трьох чисел.

number1 = int(input('Введіть число 1: '))
number2 = int(input('Введіть число 2: '))
number3 = int(input('Введіть число 3: '))
x = int(input('1. Щоб вивести максимум натисніть 1. '
              '\n2. Щоб вивести мінімум натисніть 2. '
              '\n3. Щоб вивести середньоарифметичне натисніть 3. '
              '\n'))
if x == 1:
    print(max(number1, number2, number3))
elif x == 2:
    print(min(number1, number2, number3))
elif x == 3:
    print(sum([number1,number2, number3])/2)