# Завдання 1
# Користувач вводить з клавіатури номер дня тижня (1-7).
# Виведіть на екран назву дня тижня. Наприклад, якщо введено
# 1, то на екрані з’явиться напис «Понеділок», 2 — вівторок і т. д.

day = int(input('Введіть номер дня тижня від 1 до 7: '))
if day == 1:
    print('Понеділок')
elif day == 2:
    print('Вівторок')
elif day == 3:
    print('Середа')
elif day == 4:
    print('Четвер')
elif day == 5:
    print('П ятниця')
elif day == 6:
    print('Субота')
elif day == 7:
    print('Неділя')
else:
    print('В тижні тільи 7 днів. Введіть від 1 до 7')
