#   Завдання 3
#  Користувач вводить з клавіатури два числа (початок та кінець
# діапазону). Проаналізуйте усі числа у цьому діапазоні. Виведення на екран має відбуватися за правилами, наведеними нижче.
# Якщо число кратне 3 (ділиться на 3 без остачі), виведіть
# слово «Fizz». Якщо число кратне 5, виведіть слово «Buzz». Якщо
# число кратне 3 та 5, виведіть «Fizz Buzz». Якщо число не кратне
# ні 3, ані 5, виведіть тільки число.

x = int(input('Enter the start of the range : '))
y  = int(input('Enter the end of the range : '))
for num in range(x,y+1) :
    if num % 3 == 0 and num % 5 == 0 :
        print(' Fizz Buzz ')
    elif num % 3 == 0 :
        print(' Fizz ')
    elif num % 5 == 0 :
        print(' Buzz ')
    else:
        print(num)