# Завдання 1.
# Користувач вводить з клавіатури три числа. Залежно від
# вибору користувача, програма виводить на екран суму трьох
# чисел або добуток трьох чисел.

number1 = int(input('Введіть число 1: '))
number2 = int(input('Введіть число 2: '))
number3 = int(input('Введіть число 3: '))
x = int(input('1.Шоб розрахувати сумму натисніть 1. '
              '\n2.Щоб розрахувати добуток натисні1ть 2. '
              '\n'))
if x == 1:
    print(sum([number1, number2, number3]))
elif x == 2:
    print(number1*number2*number3)
